Repository: durasj/octosign
Catalog: translations/*.po
Languages: cs_cz, sk_sk

source: Errored during operation: "{{error}}".
cs_cz: Během operace nastala chyba: "{{error}}".
sk_sk: Počas operácie nastala chyba: "{{error}}".

source: Failed to establish communication with signing component.
cs_cz: Navázání komunikace s podpisovým komponentem se nezdařilo.
sk_sk: Nepodarilo sa nadviazať komunikáciu s podpisovacím komponentom.

source: Can not parse image format
cs_cz: Nepodařilo se zpracovat formát obrázku
sk_sk: Nepodarilo sa spracovať formát obrázku

source: Signature could not be verified
cs_cz: Nepodařilo se ověřit podpis
sk_sk: Nepodarilo sa overiť podpis

source: Document could not be signed
cs_cz: Nepodařilo se podepsat dokument
sk_sk: Nepodaril sa podpísať dokument

source: Signing in progress
cs_cz: Probíhá podepisování
sk_sk: Prebieha podpisovanie

source: Verification in progress
cs_cz: Probíhá ověřování
sk_sk: Prebieha overovanie

source: File type not supported
cs_cz: Typ souboru není podporován
sk_sk: Typ súboru nie je podporovaný

source: Sign
cs_cz: Podepsat
sk_sk: Podpísať

source: Open signature details
cs_cz: Otevřít informace o podpisu
sk_sk: Otvoriť detail podpisu

source: Signing...
cs_cz: Podepisuji...
sk_sk: Podpisovanie...

source: Verifying...
cs_cz: Ověřuji...
sk_sk: Overovanie...

source: Signed
cs_cz: Podepsaný
sk_sk: Podpísaný

source: Unsigned
cs_cz: Nepodepsaný
sk_sk: Nepodpísaný

source: Unknown
cs_cz: Neznámý
sk_sk: Neznáme

source: Invalid
cs_cz: Neplatný
sk_sk: Neplatný

source: Size: {{size}}
cs_cz: Velikost: {{size}}
sk_sk: Veľkosť: {{size}}

source: Last modified: {{date}}
cs_cz: Poslední úprava: {{date}}
sk_sk: Naposledy upravený: {{date}}

source: Signature details
cs_cz: Informace o podpisu
sk_sk: Detail podpisu

source: Close
cs_cz: Zavřít
sk_sk: Zatvoriť

source: Drop your files here
cs_cz: Zde vložte soubory
sk_sk: Pustite sem súbory

source: Select your file
cs_cz: Vyberte svůj soubor
sk_sk: Vyberte váš súbor

source: Select files
cs_cz: Zvolit soubory
sk_sk: Vybrať súbory

source: or drag and drop your files anywhere
cs_cz: nebo soubory chyťte a pusťte kdekoliv
sk_sk: alebo chyťte a kdekoľvek pusťte súbory

source: Help
cs_cz: Pomoc
sk_sk: Pomoc

source: Settings
cs_cz: Nastavení
sk_sk: Nastavenia

source: Clear
cs_cz: Vymazat
sk_sk: Vyčistiť

source: Choose image
cs_cz: Vyberte obrázek
sk_sk: Vybrať obrázok

source: Previous page
cs_cz: Předchozí stránka
sk_sk: Predošlá stránka

source: Next page
cs_cz: Další stránka
sk_sk: Ďalšia stránka

source: You need to draw your signature or select file.
cs_cz: Musíte buď nakreslit svůj podpis nebo zvolit soubor.
sk_sk: Musíte nakresliť svoj podpis alebo vybrať súbor.

source: Password
cs_cz: Heslo
sk_sk: Heslo

source: Pick page and position for you signature
cs_cz: Zvolte stránku a pozici vašeho podpisu
sk_sk: Vyberte stránku a pozíciu pre váš podpis

source: Draw your signature or pick saved image
cs_cz: Nakreslete svůj podpis nebo zvolte uložený obrázek
sk_sk: Nakreslite svoj podpis alebo vyberte obrázok

source: Yes
cs_cz: Ano
sk_sk: Áno

source: No
cs_cz: Ne
sk_sk: Nie

source: Prompt type "{{type}}" is not yet supported. Please open a feature request on the Octosign repository.
cs_cz: Prompt typu "{{type}}" zatím není podporován. Zadejte prosím požadavek do repozitáře Octosign.
sk_sk: Prompt typu "{{type}}" ešte nie je podporovaný. Prosím otvorte požiadavku o pridanie na Octosign repozitári.

source: Confirm
cs_cz: Potvrdit
sk_sk: Potvrdiť

source: Cancel
cs_cz: Zrušit
sk_sk: Zrušiť

source: General
cs_cz: Všeobecné
sk_sk: Všeobecné

source: Language
cs_cz: Jazyk
sk_sk: Jazyk

source: Advanced electronic signature
cs_cz: Pokročilý elektronický podpis
sk_sk: Pokročilý elektronický podpis

source: Advanced electronic signature usable on PDF and other documents using cryptography. Requires an usable certificate and signing drivers (for example ID cards and readers of EU citizens). Uses Digital Signature Service from European Commission licensed under the LGPL-2.1.
cs_cz: Pokročilý elektronický podpis použitelný v PDF a jiných dokumentech za použití kryptografie. Vyžaduje použitelný certifikát (například občanský průkaz a čtečku dostupnou v některých státech EU). Využívá knihovnu Digital Signature Service od Evropské komise s licencí LGPL-2.1.
sk_sk: Pokročilý elektronický podpis použiteľný na PDF a iných dokumentoch použitím kryptografie. Vyžaduje použiteľný certifikát a ovládače (napríklad občiansky preukaz a čítačku dostupnú v niektorých EU štátoch). Používa knižnicu Digital Signature Service od European Commission s licenciou LGPL-2.1.

source: Can not find supported PKCS DLL.
cs_cz: Podporované PKCS DLL nenalezeno.
sk_sk: Nebolo možné nájsť podporované PKCS DLL

source: PKCS #11/#12 Path
cs_cz: Cesta k PKCS #11/#12

source: Timestamping Server URL
cs_cz: URL serveru na časové razítka
sk_sk: URL servera na časové pečiatky

source: PKCS #11/#12 path doesn't exist. Please check Settings and Help.
cs_cz: Cesta k PKCS #11/#12 neexistuje. Zkontrolujte prosím Nastavení a Pomoc.

source: PKCS #11/#12 path is not configured. Please check Settings and Help.
cs_cz: Cesta k PKCS #11/#12 není nastavena. Zkontrolujte prosím Nastavení a Pomoc.

source: Signed file path was not chosen.
cs_cz: Cesta pro podepsaný dokument nebyla zadána.
sk_sk: Cesta pre podpísaný dokument nebola zvolená.

source: Please provide the key password.
cs_cz: Prosím, zadejte heslo ke klíči.

source: There was an error saving the signed document.
cs_cz: Při podepisování uloženého dokumentu nastala chyba.
sk_sk: Vyskytla sa chyba pri ukladaní podpísaného dokumentu.

source: Please pick a certificate for signing
cs_cz: Prosím, zvolte certifikát pro podepisování.
sk_sk: Prosím vyberte certifikát pre podpísanie

source: Key was not chosen.
cs_cz: Klíč nebyl zadán.
sk_sk: Nebol zvolený kľúč.

source: Getting signing certificates failed. Please check Settings and Help.
cs_cz: Získání podpisových certifikátů se nezdařilo. Zkontrolujte prosím Nastavení a Pomoc.

source: Using of the PKCS #11 library failed.
cs_cz: Využití knihovny PKCS #11 se nezdařilo.
sk_sk: Použitie PKCS #11 knižnice zlyhalo.

source: Using of the PKCS #12 file failed.
cs_cz: Použití souboru PKCS # 12 selhalo.

source: Using of the MS CAPI failed.
cs_cz: Použití MS CAPI selhalo.

source: Signed by
cs_cz: Podepsal
sk_sk: Podpísal

source: Validity
cs_cz: Platnost
sk_sk: Platnosť

source: Date and time
cs_cz: Datum a čas
sk_sk: Dátum a čas

source: Qualification
cs_cz: Kvalifikace
sk_sk: Kvalifikácia

source: Chain of trust
cs_cz: Řetězec důvěry
sk_sk: Reťazec dôvery

source: Potential problems
cs_cz: Potenciální problémy
sk_sk: Potenciálne problémy

source: Valid
cs_cz: Platný
sk_sk: Platný

source: This is probably due to corrupted installation.
cs_cz: Příčina je pravděpodobně v poškozené instalaci.
sk_sk: Je to pravdepodobne spôsobené poškodenou inštaláciou.

source: Qualified Electronic Signature
cs_cz: Kvalifikovaný elektronický podpis
sk_sk: Kvalifikovaný elektronický podpis

source: Qualified Electronic Seal
cs_cz: Kvalifikovaná elektronická pečeť
sk_sk: Kvalifikovaná elektronická pečať

source: Qualified Electronic Signature or Seal
cs_cz: Kvalifikovaný elektronický podpis nebo pečeť
sk_sk: Kvalifikovaný elektronický podpis alebo pečať

source: Advanced Electronic Signature
cs_cz: Zdokonalený elektronický podpis
sk_sk: Zdokonalený elektronický podpis

source: Advanced Electronic Seal
cs_cz: Zdokonalená elektronická pečeť
sk_sk: Zdokonalená elektronická pečať

source: Advanced Electronic Signature or Seal
cs_cz: Zdokonalený elektronický podpis nebo pečeť
sk_sk: Zdokonalený elektronický podpis alebo pečať

source: Not Advanced Electronic Signature but supported by a Qualified Certificate
cs_cz: Není zdokonalený elektronický podpis, ale používá kvalifikovaný certifikát
sk_sk: Nie zdokonalený elektronický podpis, ale používa kvalifikovaný certifikát

source: Not Advanced Electronic Signature
cs_cz: Ne zdokonalený elektronický podpis
sk_sk: Nie zdokonalený elektronický podpis

source: Not applicable
cs_cz: Neaplikovatelné
sk_sk: Neaplikovateľné

source: Unreachable
cs_cz: Nedosažitelné
sk_sk: Nedosiahnuteľný

source: Simple image signature
cs_cz: Jednoduchý podpis obrázkem
sk_sk: Jednoduchý podpis obrázkom

source: Signs PDFs using chosen image or drawn signature. Based on the unipdf library from FoxyUtils ehf licensed under the AGPLv3.
cs_cz: Podepisování PDF s využitím obrázku nebo nakreslením podpisu. Využívá knihovnu unipdf od FoxyUtils ehf s licencí AGPLv3.
sk_sk: Podpisovanie PDF súborov použitím obrázku alebo nakreslením podpisu. Používa knižnicu unipdf od FoxyUtils ehf s licenciou AGPLv3.

source: Signature file
cs_cz: Soubor s podpisem
sk_sk: Súbor s podpisom

source: Signature position
cs_cz: Umístění podpisu
sk_sk: Pozícia podpisu

source: Save signed file as
cs_cz: Uložit podepsaný soubor jako
sk_sk: Uložiť podpísaný súbor ako

source: No answer, aborting.
cs_cz: Nemám odpověď. Přerušuji.
sk_sk: Žiadna odpoveď, prerušené.

source: Autoconfiguration failed. Please check Settings and Help.
sk_sk: Autokonfigurácia zlyhala. Prosím skontrolujete Nastavenia a Pomoc.

source: PKCS #11 Library Path
sk_sk: Cesta k PKCS #11 knižnici

source: PKCS #11 library path is not configured. Please check Settings and Help.
sk_sk: Cesta k PKCS #11 knižnici nie je nastavená. Prosím skontrolujete Nastavenia a Pomoc.

source: PKCS #11 library doesn't exist. Please check Settings and Help.
sk_sk: PKCS #11 knižnica neexistuje. Prosím skontrolujete Nastavenia a Pomoc.

source: Timestamping server URL is not configured.
sk_sk: URL servera na časové pečiatky nie je nastavená.

source: Please provide the private key password.
sk_sk: Prosím zadajte heslo k privátnemu kľúču.

source: Communication with device failed.
sk_sk: Komunikácia so zariadením zlyhala.
